Merge branch 'feat/1282-adopt-mermaid-for-diagrams-in-the-docs-a' into 'main'
docs(website): adopt build-time Mermaid rendering for docs diagrams

Closes #1282

See merge request trueppm/trueppm!1014
